GadgetOnOff Project/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
</mdclass:Enum>

GadgetOnOff Project/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеЮридическоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчётПоУмолчанию</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
</mdclass:Catalog>

GadgetOnOff Project/src/CommonModules/ЗагрузкиИзВнешнихИсточниковСервер/Module.bsl
Процедура ЗагрузкиИзИсточниковСервер(ПутьКФайлу) Экспорт
	
	//Получить текстовый документ
	Документ = Новый ТекстовыйДокумент;
	Документ.Прочитать(ПутьКФайлу);
	
	//Построчный обход текстового документа
	Для НомерСтроки = 2 По Документ.КоличествоСтрок() Цикл
		
		//Получить строку документа
		СтрокаДокумента = Документ.ПолучитьСтроку(НомерСтроки);
		
		//Разложим каждое значение, разделенное ; в массив
		МассивЗначенийСтроки = СтрРазделить(СтрокаДокумента, ";");
		
		//Получить значение массива
		НаименованиеКонтрагента    = МассивЗначенийСтроки[0];
		НаименованиеРодителя       = МассивЗначенийСтроки[1];
		НаименованиеИНН            = МассивЗначенийСтроки[2];
		НаименованиеВидКонтрагента = МассивЗначенийСтроки[3];
		
		//Проверка на создание повторного элемента в Общие модули>СоздатьСправочник>Функция "ПроверкаЭлемента"  
		
		//Создать элемент
		НовыйЭлементКонтрагенты = Справочники.Контрагенты.СоздатьЭлемент();	
		НовыйЭлементКонтрагенты.Наименование = НаименованиеКонтрагента;
		НовыйЭлементКонтрагенты.ИНН          = НаименованиеИНН;
		
		Если НаименованиеВидКонтрагента = "Юридическое лицо" Тогда
			
			НовыйЭлементКонтрагенты.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо;
			
		ИначеЕсли НаименованиеВидКонтрагента = "Физическое лицо" Тогда
			
			НовыйЭлементКонтрагенты.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо;
			
		КонецЕсли;
		
		//Ищем группу в файле
		Если НЕ ПустаяСтрока(НаименованиеРодителя) Тогда
			
			//Ищем группу по названию и присваиваем родителя
			НовыйЭлементКонтрагенты.Родитель = Справочники.Контрагенты.НайтиПоНаименованию(НаименованиеРодителя, Истина);
			
			//Если отсутвует, создаем
			Если НовыйЭлементКонтрагенты.Родитель.Пустая() Тогда
				НовыйЭлементГруппа               = Справочники.Контрагенты.СоздатьГруппу();
				НовыйЭлементГруппа.Наименование  = НаименованиеРодителя;
				НовыйЭлементГруппа.Записать();
				НовыйЭлементКонтрагенты.Родитель = НовыйЭлементГруппа.Ссылка;	
			КонецЕсли;	
			
		КонецЕсли;
		
		НовыйЭлементКонтрагенты.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
